#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

<details>
  <summary>Validation Output</summary>

  ```

  Success! The configuration is valid.


  ```

</details>

#### Terraform Plan 📖`success`

<details>
  <summary>Show Plan</summary>

  ```

  terraform
cloudflare_record.record["66117ce3d2f787b55de4e5aa859ffceb.2"]: Refreshing state... [id=7a9eaa3f81268ba36b5b1d69f09d9d87]
cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.16"]: Refreshing state... [id=78191894b82967437254b118011307a1]
cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.1"]: Refreshing state... [id=30cd9cce97a080c4e84a8adc09cd2b59]
cloudflare_record.record["66117ce3d2f787b55de4e5aa859ffceb.3"]: Refreshing state... [id=8c2b654eb6e249227245ce47678c689b]
cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.12"]: Refreshing state... [id=721ace48de0a46d95766c43874ec33bf]
cloudflare_record.record["66117ce3d2f787b55de4e5aa859ffceb.4"]: Refreshing state... [id=cbd369c61c0e02ac8ccda1ed09d6939b]
cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.14"]: Refreshing state... [id=576302bb4b58b44fd7a4e10230b77eef]
cloudflare_record.record["f887b3adea226972affc939e06efab29.4"]: Refreshing state... [id=b9fd1c6b3a86b4a79ef4341b5e34f29b]
cloudflare_record.record["f887b3adea226972affc939e06efab29.1"]: Refreshing state... [id=8c9d207c65067164576e838625aaa953]
cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.15"]: Refreshing state... [id=98d3e4a80b27951901bc17000493382a]
cloudflare_record.record["f887b3adea226972affc939e06efab29.6"]: Refreshing state... [id=b4a511b0242898d449752724991cc5a4]
cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.9"]: Refreshing state... [id=dc70fa1ee67bd4fdec2c5b7b7fe3b01d]
cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.0"]: Refreshing state... [id=1ddf9f171998c80169fad84a3e783587]
cloudflare_record.record["483ae9ae0485ed8fd56158fb9309d648.8"]: Refreshing state... [id=66f784b55017d158d516ae7fb5f158a4]
cloudflare_record.record["483ae9ae0485ed8fd56158fb9309d648.0"]: Refreshing state... [id=a5cf85b84916e9b026f3660e625d04cc]
cloudflare_record.record["66117ce3d2f787b55de4e5aa859ffceb.1"]: Refreshing state... [id=abcd1a458f6b83964b94edf489c954de]
cloudflare_record.record["f887b3adea226972affc939e06efab29.5"]: Refreshing state... [id=8cd3e38b8a2f1aeccf32687795b566d2]
cloudflare_record.record["483ae9ae0485ed8fd56158fb9309d648.6"]: Refreshing state... [id=af7590d956487b9ede54da4cc5ae0288]
cloudflare_record.record["66117ce3d2f787b55de4e5aa859ffceb.5"]: Refreshing state... [id=fe387bd5c0c0b76a860ffd42c4ebe748]
cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.3"]: Refreshing state... [id=93c87ae252b609205ce1c6b81bf3de7a]
cloudflare_record.record["483ae9ae0485ed8fd56158fb9309d648.9"]: Refreshing state... [id=bcf27b60c000f00eafca87978b7b9bd2]
cloudflare_record.record["f887b3adea226972affc939e06efab29.0"]: Refreshing state... [id=54e00588c994e9d4d8b834048ddc3483]
cloudflare_record.record["66117ce3d2f787b55de4e5aa859ffceb.0"]: Refreshing state... [id=0ae6701412c8a5dbf60bd6abeb85d921]
cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.11"]: Refreshing state... [id=dfd0796fa0d5343d8ba4f27baa8e8d0e]
cloudflare_record.record["f887b3adea226972affc939e06efab29.3"]: Refreshing state... [id=fabc8f7927b54fdae4c635ffc07ea8a2]
cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.13"]: Refreshing state... [id=8c3a447333d8ec44f6409df12f23558e]
cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.10"]: Refreshing state... [id=961d0f6490efed2656c609fb6d1d806c]
cloudflare_record.record["483ae9ae0485ed8fd56158fb9309d648.7"]: Refreshing state... [id=6e7c185563ead6e746b828120a5b4ab7]
cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.2"]: Refreshing state... [id=9356ada7c4b54eb03c626666b6b63ee0]
cloudflare_record.record["f887b3adea226972affc939e06efab29.2"]: Refreshing state... [id=5c150b0fee7e7dd89a811ed37144b936]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # cloudflare_record.ojilabcloud_a_access_demo1 will be created
  + resource "cloudflare_record" "ojilabcloud_a_access_demo1" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "access-demo"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "A"
      + value           = "185.199.111.153"
      + zone_id         = "f887b3adea226972affc939e06efab29"
    }

  # cloudflare_record.ojilabcloud_a_access_demo2 will be created
  + resource "cloudflare_record" "ojilabcloud_a_access_demo2" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "access-demo"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "A"
      + value           = "185.199.110.153"
      + zone_id         = "f887b3adea226972affc939e06efab29"
    }

  # cloudflare_record.ojilabcloud_a_access_demo3 will be created
  + resource "cloudflare_record" "ojilabcloud_a_access_demo3" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "access-demo"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "A"
      + value           = "185.199.109.153"
      + zone_id         = "f887b3adea226972affc939e06efab29"
    }

  # cloudflare_record.ojilabcloud_a_access_demo4 will be created
  + resource "cloudflare_record" "ojilabcloud_a_access_demo4" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "access-demo"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "A"
      + value           = "185.199.108.153"
      + zone_id         = "f887b3adea226972affc939e06efab29"
    }

  # cloudflare_record.ojilabcloud_a_reservation will be created
  + resource "cloudflare_record" "ojilabcloud_a_reservation" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "reservation"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "A"
      + value           = "199.36.158.100"
      + zone_id         = "f887b3adea226972affc939e06efab29"
    }

  # cloudflare_record.ojilabcloud_txt_access_demo will be created
  + resource "cloudflare_record" "ojilabcloud_txt_access_demo" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_github-pages-challenge-oldbigbuddha.access-demo"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "c2844569820fc5a1fb0d4a67a700eb"
      + zone_id         = "f887b3adea226972affc939e06efab29"
    }

  # cloudflare_record.ojilabcloud_txt_root_googlesiteverification will be created
  + resource "cloudflare_record" "ojilabcloud_txt_root_googlesiteverification" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "ojilab.cloud"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "google-site-verification=vrUCYxByqZoTy6Ad9LxX36pZ08uwlyf3BdjGkl2LOS0"
      + zone_id         = "f887b3adea226972affc939e06efab29"
    }

  # cloudflare_record.oldbigbuddhadev_a_root will be created
  + resource "cloudflare_record" "oldbigbuddhadev_a_root" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.dev"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "A"
      + value           = "76.76.21.21"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.oldbigbuddhadev_a_sample will be created
  + resource "cloudflare_record" "oldbigbuddhadev_a_sample" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "sample"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "CNAME"
      + value           = "oldbigbuddha-sample.netlify.app"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.oldbigbuddhadev_a_wp will be created
  + resource "cloudflare_record" "oldbigbuddhadev_a_wp" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "wp"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "A"
      + value           = "49.212.175.115"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.oldbigbuddhadev_cname_www will be created
  + resource "cloudflare_record" "oldbigbuddhadev_cname_www" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "CNAME"
      + value           = "oldbigbuddha.dev"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.oldbigbuddhadev_mx_root1 will be created
  + resource "cloudflare_record" "oldbigbuddhadev_mx_root1" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.dev"
      + priority        = 10
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "aspmx3.googlemail.com"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.oldbigbuddhadev_mx_root2 will be created
  + resource "cloudflare_record" "oldbigbuddhadev_mx_root2" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.dev"
      + priority        = 10
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "aspmx2.googlemail.com"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.oldbigbuddhadev_mx_root3 will be created
  + resource "cloudflare_record" "oldbigbuddhadev_mx_root3" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.dev"
      + priority        = 5
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "alt2.aspmx.l.google.com"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.oldbigbuddhadev_mx_root4 will be created
  + resource "cloudflare_record" "oldbigbuddhadev_mx_root4" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.dev"
      + priority        = 5
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "alt1.aspmx.l.google.com"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.oldbigbuddhadev_mx_root5 will be created
  + resource "cloudflare_record" "oldbigbuddhadev_mx_root5" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.dev"
      + priority        = 1
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "aspmx.l.google.com"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.oldbigbuddhadev_txt_atproto will be created
  + resource "cloudflare_record" "oldbigbuddhadev_txt_atproto" {
      + allow_overwrite = false
      + comment         = "AT Protocol"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_atproto"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 86400
      + type            = "TXT"
      + value           = "did=did:plc:5qggovenhhspe74jcnygnxsr"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.oldbigbuddhadev_txt_discord will be created
  + resource "cloudflare_record" "oldbigbuddhadev_txt_discord" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_discord"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "dh=fc30d3d8be43cbae588075a516f13a2c7ee55e6c"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.oldbigbuddhadev_txt_dmarc will be created
  + resource "cloudflare_record" "oldbigbuddhadev_txt_dmarc" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_dmarc"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DMARC1; p=quarantine; pct=100; rua=mailto:abuse@oldbigbuddha.dev; aspf=s"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.oldbigbuddhadev_txt_googledomainkey will be created
  + resource "cloudflare_record" "oldbigbuddhadev_txt_googledomainkey" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "google._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DKIM1; k=rsa; p=MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEArrysCaKuRdl0yOcag/gKceC35XG7Z16P5N1nQ3ZkS5JqOr215KcJx1Z6PCISKJqD+j0+mzyuxupR4+60Tq9kFEbqLt6vIGSZe0MX3dJXMAGW/Nz/bz2SdPn5jb5dy5vBij5Js+TL1mkWJJSN7EAV4wLd3hNJLNFVbM4KC53lhDSCbo6lAlRzV46wrVwip4fERM4p9C4Kft4BObfWMYGrlRShEJTY/RYakxm7q8DZo2yIRnJSL1kb3pKrvjDRGWwo8PR1tvOQdUfLQ7R6RAjud+K8A/9eROmKXU/96l5I2SEUR6vqcM0XZZllSVkqh1nODdCKJZwKfe/vBoIJzrEh7wIDAQAB"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.oldbigbuddhadev_txt_keybase will be created
  + resource "cloudflare_record" "oldbigbuddhadev_txt_keybase" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_keybase"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "keybase-site-verification=x6O4-tjJZYjjGBqo2ETLsRcWSssKT4oFzqZ8o7qomsQ"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.oldbigbuddhadev_txt_root_googlesiteverification will be created
  + resource "cloudflare_record" "oldbigbuddhadev_txt_root_googlesiteverification" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.dev"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "google-site-verification=mkuH-GziO_LEwhNkcUYDGX-Nd9SfdRhkwsnOeFWDJuM"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.oldbigbuddhadev_txt_root_openai will be created
  + resource "cloudflare_record" "oldbigbuddhadev_txt_root_openai" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.dev"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "openai-domain-verification=dv-3wTUxEgEdL7mE4cwQURCV5sJ"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.oldbigbuddhadev_txt_root_spf will be created
  + resource "cloudflare_record" "oldbigbuddhadev_txt_root_spf" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.dev"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=spf1 include:_spf.google.com ~all"
      + zone_id         = "85b3d2cf975460a72eb76acf63413fd8"
    }

  # cloudflare_record.oldbigbuddhanet_cname_root will be created
  + resource "cloudflare_record" "oldbigbuddhanet_cname_root" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.net"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "CNAME"
      + value           = "oldbigbuddha.dev"
      + zone_id         = "483ae9ae0485ed8fd56158fb9309d648"
    }

  # cloudflare_record.oldbigbuddhanet_mx_root1 will be created
  + resource "cloudflare_record" "oldbigbuddhanet_mx_root1" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.net"
      + priority        = 10
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "alt4.aspmx.l.google.com"
      + zone_id         = "483ae9ae0485ed8fd56158fb9309d648"
    }

  # cloudflare_record.oldbigbuddhanet_mx_root2 will be created
  + resource "cloudflare_record" "oldbigbuddhanet_mx_root2" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.net"
      + priority        = 10
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "alt3.aspmx.l.google.com"
      + zone_id         = "483ae9ae0485ed8fd56158fb9309d648"
    }

  # cloudflare_record.oldbigbuddhanet_mx_root3 will be created
  + resource "cloudflare_record" "oldbigbuddhanet_mx_root3" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.net"
      + priority        = 5
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "alt2.aspmx.l.google.com"
      + zone_id         = "483ae9ae0485ed8fd56158fb9309d648"
    }

  # cloudflare_record.oldbigbuddhanet_mx_root4 will be created
  + resource "cloudflare_record" "oldbigbuddhanet_mx_root4" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.net"
      + priority        = 5
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "alt1.aspmx.l.google.com"
      + zone_id         = "483ae9ae0485ed8fd56158fb9309d648"
    }

  # cloudflare_record.oldbigbuddhanet_mx_root5 will be created
  + resource "cloudflare_record" "oldbigbuddhanet_mx_root5" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.net"
      + priority        = 1
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "aspmx.l.google.com"
      + zone_id         = "483ae9ae0485ed8fd56158fb9309d648"
    }

  # cloudflare_record.oldbigbuddhanet_txt_dmarc will be created
  + resource "cloudflare_record" "oldbigbuddhanet_txt_dmarc" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_dmarc"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DMARC1; p=quarantine; pct=100; rua=mailto:abuse@oldbigbuddha.net; aspf=s"
      + zone_id         = "483ae9ae0485ed8fd56158fb9309d648"
    }

  # cloudflare_record.oldbigbuddhanet_txt_googledomainkey will be created
  + resource "cloudflare_record" "oldbigbuddhanet_txt_googledomainkey" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "google._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DKIM1; k=rsa; p=MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAqOyjJhcyOtHHtLIz22K5IxzuO1vDWqLZaJqwYn6q4vwrb5pg3bXWJ9OLQjLUlkZodINjDNNVHDfNx3ZSzqE9VSMvuYSUWNJ27jhS5QpjaBzEJiY62UlyytXWDQtXrJAlpiVwGYNYFTboQ6mx27MaHXDod7rZ3Xdt10FMIH74k2YmUTt9GamJ0h4+KRv1nr9FMPoxHpkdvH5wcwpvusbZwCMurOV/9R+z9v42JCKCrOp+ZIU7Dnu3gceVb+HbKWSuHUxKuTUBLp/SASdAUtmOvMcTRfmA9ge0+NKdZQwhoAh246QVwZ2OFmrR5gk3qYIDHgKCm9d715oxbcHxifGt6wIDAQAB"
      + zone_id         = "483ae9ae0485ed8fd56158fb9309d648"
    }

  # cloudflare_record.oldbigbuddhanet_txt_root_keybase will be created
  + resource "cloudflare_record" "oldbigbuddhanet_txt_root_keybase" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.net"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "keybase-site-verification=lCspfXMW8Na3T6EHnSE3Fun3l4Je28Y_5jGjzJ4XvQU"
      + zone_id         = "483ae9ae0485ed8fd56158fb9309d648"
    }

  # cloudflare_record.oldbigbuddhanet_txt_root_spf will be created
  + resource "cloudflare_record" "oldbigbuddhanet_txt_root_spf" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oldbigbuddha.net"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=spf1 include:_spf.google.com ~all"
      + zone_id         = "483ae9ae0485ed8fd56158fb9309d648"
    }

  # cloudflare_record.record["483ae9ae0485ed8fd56158fb9309d648.0"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T03:11:07.085237Z" -> null
      - hostname        = "oldbigbuddha.net" -> null
      - id              = "a5cf85b84916e9b026f3660e625d04cc" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T03:11:07.085237Z" -> null
      - name            = "oldbigbuddha.net" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "CNAME" -> null
      - value           = "oldbigbuddha.dev" -> null
      - zone_id         = "483ae9ae0485ed8fd56158fb9309d648" -> null
    }

  # cloudflare_record.record["483ae9ae0485ed8fd56158fb9309d648.6"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T03:11:13.241779Z" -> null
      - hostname        = "_dmarc.oldbigbuddha.net" -> null
      - id              = "af7590d956487b9ede54da4cc5ae0288" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T03:11:13.241779Z" -> null
      - name            = "_dmarc" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "TXT" -> null
      - value           = "v=DMARC1; p=quarantine; pct=100; rua=mailto:abuse@oldbigbuddha.net; aspf=s" -> null
      - zone_id         = "483ae9ae0485ed8fd56158fb9309d648" -> null
    }

  # cloudflare_record.record["483ae9ae0485ed8fd56158fb9309d648.7"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T03:11:16.758088Z" -> null
      - hostname        = "google._domainkey.oldbigbuddha.net" -> null
      - id              = "6e7c185563ead6e746b828120a5b4ab7" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T03:11:16.758088Z" -> null
      - name            = "google._domainkey" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "TXT" -> null
      - value           = "v=DKIM1; k=rsa; p=MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAqOyjJhcyOtHHtLIz22K5IxzuO1vDWqLZaJqwYn6q4vwrb5pg3bXWJ9OLQjLUlkZodINjDNNVHDfNx3ZSzqE9VSMvuYSUWNJ27jhS5QpjaBzEJiY62UlyytXWDQtXrJAlpiVwGYNYFTboQ6mx27MaHXDod7rZ3Xdt10FMIH74k2YmUTt9GamJ0h4+KRv1nr9FMPoxHpkdvH5wcwpvusbZwCMurOV/9R+z9v42JCKCrOp+ZIU7Dnu3gceVb+HbKWSuHUxKuTUBLp/SASdAUtmOvMcTRfmA9ge0+NKdZQwhoAh246QVwZ2OFmrR5gk3qYIDHgKCm9d715oxbcHxifGt6wIDAQAB" -> null
      - zone_id         = "483ae9ae0485ed8fd56158fb9309d648" -> null
    }

  # cloudflare_record.record["483ae9ae0485ed8fd56158fb9309d648.8"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T03:11:11.956155Z" -> null
      - hostname        = "oldbigbuddha.net" -> null
      - id              = "66f784b55017d158d516ae7fb5f158a4" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T03:11:11.956155Z" -> null
      - name            = "oldbigbuddha.net" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "TXT" -> null
      - value           = "v=spf1 include:_spf.google.com ~all" -> null
      - zone_id         = "483ae9ae0485ed8fd56158fb9309d648" -> null
    }

  # cloudflare_record.record["483ae9ae0485ed8fd56158fb9309d648.9"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T03:11:07.336209Z" -> null
      - hostname        = "oldbigbuddha.net" -> null
      - id              = "bcf27b60c000f00eafca87978b7b9bd2" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T03:11:07.336209Z" -> null
      - name            = "oldbigbuddha.net" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "TXT" -> null
      - value           = "keybase-site-verification=lCspfXMW8Na3T6EHnSE3Fun3l4Je28Y_5jGjzJ4XvQU" -> null
      - zone_id         = "483ae9ae0485ed8fd56158fb9309d648" -> null
    }

  # cloudflare_record.record["66117ce3d2f787b55de4e5aa859ffceb.0"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T03:11:17.365979Z" -> null
      - hostname        = "roppo-json.dev" -> null
      - id              = "0ae6701412c8a5dbf60bd6abeb85d921" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T03:11:17.365979Z" -> null
      - name            = "roppo-json.dev" -> null
      - proxiable       = true -> null
      - proxied         = true -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "A" -> null
      - value           = "185.199.111.153" -> null
      - zone_id         = "66117ce3d2f787b55de4e5aa859ffceb" -> null
    }

  # cloudflare_record.record["66117ce3d2f787b55de4e5aa859ffceb.1"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T03:11:06.096635Z" -> null
      - hostname        = "roppo-json.dev" -> null
      - id              = "abcd1a458f6b83964b94edf489c954de" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T03:11:06.096635Z" -> null
      - name            = "roppo-json.dev" -> null
      - proxiable       = true -> null
      - proxied         = true -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "A" -> null
      - value           = "185.199.110.153" -> null
      - zone_id         = "66117ce3d2f787b55de4e5aa859ffceb" -> null
    }

  # cloudflare_record.record["66117ce3d2f787b55de4e5aa859ffceb.2"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T03:11:11.555337Z" -> null
      - hostname        = "roppo-json.dev" -> null
      - id              = "7a9eaa3f81268ba36b5b1d69f09d9d87" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T03:11:11.555337Z" -> null
      - name            = "roppo-json.dev" -> null
      - proxiable       = true -> null
      - proxied         = true -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "A" -> null
      - value           = "185.199.108.153" -> null
      - zone_id         = "66117ce3d2f787b55de4e5aa859ffceb" -> null
    }

  # cloudflare_record.record["66117ce3d2f787b55de4e5aa859ffceb.3"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T03:11:08.455677Z" -> null
      - hostname        = "roppo-json.dev" -> null
      - id              = "8c2b654eb6e249227245ce47678c689b" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T03:11:08.455677Z" -> null
      - name            = "roppo-json.dev" -> null
      - proxiable       = true -> null
      - proxied         = true -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "A" -> null
      - value           = "185.199.109.153" -> null
      - zone_id         = "66117ce3d2f787b55de4e5aa859ffceb" -> null
    }

  # cloudflare_record.record["66117ce3d2f787b55de4e5aa859ffceb.4"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T03:11:12.371948Z" -> null
      - hostname        = "api.roppo-json.dev" -> null
      - id              = "cbd369c61c0e02ac8ccda1ed09d6939b" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T03:11:12.371948Z" -> null
      - name            = "api" -> null
      - proxiable       = true -> null
      - proxied         = true -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "CNAME" -> null
      - value           = "terrestrial-gazelle-ijjn6zwnr5j3rtnvyufwyi0s.herokudns.com" -> null
      - zone_id         = "66117ce3d2f787b55de4e5aa859ffceb" -> null
    }

  # cloudflare_record.record["66117ce3d2f787b55de4e5aa859ffceb.5"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T03:11:15.002389Z" -> null
      - hostname        = "_github-challenge-roppo-json.roppo-json.dev" -> null
      - id              = "fe387bd5c0c0b76a860ffd42c4ebe748" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T03:11:15.002389Z" -> null
      - name            = "_github-challenge-roppo-json" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "TXT" -> null
      - value           = "f0a59e5fc7" -> null
      - zone_id         = "66117ce3d2f787b55de4e5aa859ffceb" -> null
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.0"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T03:11:16.586828Z" -> null
      - hostname        = "oldbigbuddha.dev" -> null
      - id              = "1ddf9f171998c80169fad84a3e783587" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T03:11:16.586828Z" -> null
      - name            = "oldbigbuddha.dev" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "A" -> null
      - value           = "76.76.21.21" -> null
      - zone_id         = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.1"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T03:11:18.288534Z" -> null
      - hostname        = "wp.oldbigbuddha.dev" -> null
      - id              = "30cd9cce97a080c4e84a8adc09cd2b59" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T03:11:18.288534Z" -> null
      - name            = "wp" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "A" -> null
      - value           = "49.212.175.115" -> null
      - zone_id         = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.10"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T03:11:05.114535Z" -> null
      - hostname        = "_discord.oldbigbuddha.dev" -> null
      - id              = "961d0f6490efed2656c609fb6d1d806c" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T03:11:05.114535Z" -> null
      - name            = "_discord" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "TXT" -> null
      - value           = "dh=fc30d3d8be43cbae588075a516f13a2c7ee55e6c" -> null
      - zone_id         = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.11"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T03:11:10.727238Z" -> null
      - hostname        = "_dmarc.oldbigbuddha.dev" -> null
      - id              = "dfd0796fa0d5343d8ba4f27baa8e8d0e" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T03:11:10.727238Z" -> null
      - name            = "_dmarc" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "TXT" -> null
      - value           = "v=DMARC1; p=quarantine; pct=100; rua=mailto:abuse@oldbigbuddha.dev; aspf=s" -> null
      - zone_id         = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.12"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T03:11:16.341235Z" -> null
      - hostname        = "google._domainkey.oldbigbuddha.dev" -> null
      - id              = "721ace48de0a46d95766c43874ec33bf" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T03:11:16.341235Z" -> null
      - name            = "google._domainkey" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "TXT" -> null
      - value           = "v=DKIM1; k=rsa; p=MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEArrysCaKuRdl0yOcag/gKceC35XG7Z16P5N1nQ3ZkS5JqOr215KcJx1Z6PCISKJqD+j0+mzyuxupR4+60Tq9kFEbqLt6vIGSZe0MX3dJXMAGW/Nz/bz2SdPn5jb5dy5vBij5Js+TL1mkWJJSN7EAV4wLd3hNJLNFVbM4KC53lhDSCbo6lAlRzV46wrVwip4fERM4p9C4Kft4BObfWMYGrlRShEJTY/RYakxm7q8DZo2yIRnJSL1kb3pKrvjDRGWwo8PR1tvOQdUfLQ7R6RAjud+K8A/9eROmKXU/96l5I2SEUR6vqcM0XZZllSVkqh1nODdCKJZwKfe/vBoIJzrEh7wIDAQAB" -> null
      - zone_id         = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.13"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T03:11:05.576858Z" -> null
      - hostname        = "_keybase.oldbigbuddha.dev" -> null
      - id              = "8c3a447333d8ec44f6409df12f23558e" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T03:11:05.576858Z" -> null
      - name            = "_keybase" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "TXT" -> null
      - value           = "keybase-site-verification=x6O4-tjJZYjjGBqo2ETLsRcWSssKT4oFzqZ8o7qomsQ" -> null
      - zone_id         = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.14"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T03:11:11.065745Z" -> null
      - hostname        = "oldbigbuddha.dev" -> null
      - id              = "576302bb4b58b44fd7a4e10230b77eef" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T03:11:11.065745Z" -> null
      - name            = "oldbigbuddha.dev" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "TXT" -> null
      - value           = "openai-domain-verification=dv-3wTUxEgEdL7mE4cwQURCV5sJ" -> null
      - zone_id         = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.15"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T03:11:06.558173Z" -> null
      - hostname        = "oldbigbuddha.dev" -> null
      - id              = "98d3e4a80b27951901bc17000493382a" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T03:11:06.558173Z" -> null
      - name            = "oldbigbuddha.dev" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "TXT" -> null
      - value           = "v=spf1 include:_spf.google.com ~all" -> null
      - zone_id         = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.16"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T03:11:10.164296Z" -> null
      - hostname        = "oldbigbuddha.dev" -> null
      - id              = "78191894b82967437254b118011307a1" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T03:11:10.164296Z" -> null
      - name            = "oldbigbuddha.dev" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "TXT" -> null
      - value           = "google-site-verification=mkuH-GziO_LEwhNkcUYDGX-Nd9SfdRhkwsnOeFWDJuM" -> null
      - zone_id         = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.2"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T03:11:15.56357Z" -> null
      - hostname        = "sample.oldbigbuddha.dev" -> null
      - id              = "9356ada7c4b54eb03c626666b6b63ee0" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T03:11:15.56357Z" -> null
      - name            = "sample" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "CNAME" -> null
      - value           = "oldbigbuddha-sample.netlify.app" -> null
      - zone_id         = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.3"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T03:11:05.412296Z" -> null
      - hostname        = "www.oldbigbuddha.dev" -> null
      - id              = "93c87ae252b609205ce1c6b81bf3de7a" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T03:11:05.412296Z" -> null
      - name            = "www" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "CNAME" -> null
      - value           = "oldbigbuddha.dev" -> null
      - zone_id         = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.record["85b3d2cf975460a72eb76acf63413fd8.9"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T03:11:08.797594Z" -> null
      - hostname        = "_atproto.oldbigbuddha.dev" -> null
      - id              = "dc70fa1ee67bd4fdec2c5b7b7fe3b01d" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T03:11:08.797594Z" -> null
      - name            = "_atproto" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 86400 -> null
      - type            = "TXT" -> null
      - value           = "did=did:plc:5qggovenhhspe74jcnygnxsr" -> null
      - zone_id         = "85b3d2cf975460a72eb76acf63413fd8" -> null
    }

  # cloudflare_record.record["f887b3adea226972affc939e06efab29.0"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T02:39:27.978385Z" -> null
      - hostname        = "access-demo.ojilab.cloud" -> null
      - id              = "54e00588c994e9d4d8b834048ddc3483" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T02:39:27.978385Z" -> null
      - name            = "access-demo" -> null
      - proxiable       = true -> null
      - proxied         = true -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "A" -> null
      - value           = "185.199.111.153" -> null
      - zone_id         = "f887b3adea226972affc939e06efab29" -> null
    }

  # cloudflare_record.record["f887b3adea226972affc939e06efab29.1"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T02:43:27.701496Z" -> null
      - hostname        = "access-demo.ojilab.cloud" -> null
      - id              = "8c9d207c65067164576e838625aaa953" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T02:43:27.701496Z" -> null
      - name            = "access-demo" -> null
      - proxiable       = true -> null
      - proxied         = true -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "A" -> null
      - value           = "185.199.110.153" -> null
      - zone_id         = "f887b3adea226972affc939e06efab29" -> null
    }

  # cloudflare_record.record["f887b3adea226972affc939e06efab29.2"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T02:43:27.948413Z" -> null
      - hostname        = "access-demo.ojilab.cloud" -> null
      - id              = "5c150b0fee7e7dd89a811ed37144b936" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T02:43:27.948413Z" -> null
      - name            = "access-demo" -> null
      - proxiable       = true -> null
      - proxied         = true -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "A" -> null
      - value           = "185.199.109.153" -> null
      - zone_id         = "f887b3adea226972affc939e06efab29" -> null
    }

  # cloudflare_record.record["f887b3adea226972affc939e06efab29.3"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T02:43:27.448726Z" -> null
      - hostname        = "access-demo.ojilab.cloud" -> null
      - id              = "fabc8f7927b54fdae4c635ffc07ea8a2" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T02:43:27.448726Z" -> null
      - name            = "access-demo" -> null
      - proxiable       = true -> null
      - proxied         = true -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "A" -> null
      - value           = "185.199.108.153" -> null
      - zone_id         = "f887b3adea226972affc939e06efab29" -> null
    }

  # cloudflare_record.record["f887b3adea226972affc939e06efab29.4"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T02:44:54.016014Z" -> null
      - hostname        = "reservation.ojilab.cloud" -> null
      - id              = "b9fd1c6b3a86b4a79ef4341b5e34f29b" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T02:44:54.016014Z" -> null
      - name            = "reservation" -> null
      - proxiable       = true -> null
      - proxied         = true -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "A" -> null
      - value           = "199.36.158.100" -> null
      - zone_id         = "f887b3adea226972affc939e06efab29" -> null
    }

  # cloudflare_record.record["f887b3adea226972affc939e06efab29.5"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T03:11:06.794637Z" -> null
      - hostname        = "_github-pages-challenge-oldbigbuddha.access-demo.ojilab.cloud" -> null
      - id              = "8cd3e38b8a2f1aeccf32687795b566d2" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T03:11:06.794637Z" -> null
      - name            = "_github-pages-challenge-oldbigbuddha.access-demo" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "TXT" -> null
      - value           = "c2844569820fc5a1fb0d4a67a700eb" -> null
      - zone_id         = "f887b3adea226972affc939e06efab29" -> null
    }

  # cloudflare_record.record["f887b3adea226972affc939e06efab29.6"] will be destroyed
  # (because cloudflare_record.record is not in configuration)
  - resource "cloudflare_record" "record" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-07T03:11:10.522204Z" -> null
      - hostname        = "ojilab.cloud" -> null
      - id              = "b4a511b0242898d449752724991cc5a4" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-07T03:11:10.522204Z" -> null
      - name            = "ojilab.cloud" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "TXT" -> null
      - value           = "google-site-verification=vrUCYxByqZoTy6Ad9LxX36pZ08uwlyf3BdjGkl2LOS0" -> null
      - zone_id         = "f887b3adea226972affc939e06efab29" -> null
    }

  # cloudflare_record.roppojsondev_a_root1 will be created
  + resource "cloudflare_record" "roppojsondev_a_root1" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "roppo-json.dev"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "A"
      + value           = "185.199.111.153"
      + zone_id         = "66117ce3d2f787b55de4e5aa859ffceb"
    }

  # cloudflare_record.roppojsondev_a_root2 will be created
  + resource "cloudflare_record" "roppojsondev_a_root2" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "roppo-json.dev"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "A"
      + value           = "185.199.110.153"
      + zone_id         = "66117ce3d2f787b55de4e5aa859ffceb"
    }

  # cloudflare_record.roppojsondev_a_root3 will be created
  + resource "cloudflare_record" "roppojsondev_a_root3" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "roppo-json.dev"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "A"
      + value           = "185.199.108.153"
      + zone_id         = "66117ce3d2f787b55de4e5aa859ffceb"
    }

  # cloudflare_record.roppojsondev_a_root4 will be created
  + resource "cloudflare_record" "roppojsondev_a_root4" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "roppo-json.dev"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "A"
      + value           = "185.199.109.153"
      + zone_id         = "66117ce3d2f787b55de4e5aa859ffceb"
    }

  # cloudflare_record.roppojsondev_cname_api will be created
  + resource "cloudflare_record" "roppojsondev_cname_api" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "api"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "terrestrial-gazelle-ijjn6zwnr5j3rtnvyufwyi0s.herokudns.com"
      + zone_id         = "66117ce3d2f787b55de4e5aa859ffceb"
    }

  # cloudflare_record.roppojsondev_txt_root_github_challenge will be created
  + resource "cloudflare_record" "roppojsondev_txt_root_github_challenge" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_github-challenge-roppo-json"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "f0a59e5fc7"
      + zone_id         = "66117ce3d2f787b55de4e5aa859ffceb"
    }

Plan: 40 to add, 0 to change, 30 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

  ```

</details>
*Pusher: @OldBigBuddha, Action: `pull_request`, Working Directory: ``, Workflow: `terraform`*